demo-output/website/dafoam/f6a_nasa_hump/case_template/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
51626
(
(-0.850519 -0.21 2.17492e-05)
(-0.848944 -0.21 2.17492e-05)
(-0.846425 -0.21 2.17492e-05)
(-0.843906 -0.21 2.17492e-05)
(-0.841387 -0.21 2.17492e-05)
(-0.838868 -0.21 2.17492e-05)
(-0.836349 -0.21 2.17492e-05)
(-0.833829 -0.21 2.17492e-05)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
83
(
(-0.850834 -0.21 2.17492e-05)
(-0.850834 -0.21 6.73557e-05)
(-0.850834 -0.21 0.00011738)
(-0.850834 -0.21 0.000172242)
(-0.850834 -0.21 0.000232402)
(-0.850834 -0.21 0.000298361)
(-0.850834 -0.21 0.000370666)
(-0.850834 -0.21 0.000449913)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
622
(
(-0.850519 -0.21 -6.53423e-18)
(-0.848944 -0.21 -6.53423e-18)
(-0.846425 -0.21 -6.53423e-18)
(-0.843906 -0.21 -6.53423e-18)
(-0.841387 -0.21 -6.53423e-18)
(-0.838868 -0.21 -6.53423e-18)
(-0.836349 -0.21 -6.53423e-18)
(-0.833829 -0.21 -6.53423e-18)
...
)
;
    }
    sides
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
83
(
(0.672 -0.21 2.04138e-05)
(0.672 -0.21 6.12413e-05)
(0.672 -0.21 0.000102069)
(0.672 -0.21 0.000142896)
(0.672 -0.21 0.000183724)
(0.672 -0.21 0.000224551)
(0.672 -0.21 0.000266067)
(0.672 -0.21 0.000311961)
...
)
;
    }
    top
    {
        type            symmetry;
    }
}


// ************************************************************************* //
