demo-output/website/dafoam/f6a_nasa_hump/case_template/0/inletOutletFields/k_inlet
k_inlet nonuniform List<scalar>
83
(
1.1667294042409804
5.8313055693840425
9.3952679851999
10.323497888358547
10.101404224184934
9.577311793461234
9.058232173464724
8.60152420994889
...
);
